app/Controllers/Panel.php

SELECT COUNT(*) AS `numrows` FROM `usuarios`
SELECT COUNT(*) AS `numrows` FROM `autos`
SELECT COUNT(*) AS `numrows` FROM `clientes`
SELECT COUNT(*) AS `numrows` FROM `proveedores`
SELECT COUNT(*) AS `numrows` FROM `reparaciones`
---
    public function index()
    {
        if (!isset($this->sesion->id_usuario)) {
            return redirect()->to(base_url() . 'public/login');
        }

        $totalUsuarios = $this->usuarios->countAll();
        $totalAutos = $this->autos->countAll();
        $totalClientes = $this->clientes->countAll();
        $totalProveedores = $this->proveedores->countAll();
        $totalReparaciones = $this->reparaciones->countAll();