app/Controllers/Reparaciones.php

    public function index($activo = 1, $inactivo = 0)
    {
        if (!isset($this->sesion->id_usuario)) {
            return redirect()->to(base_url() . 'public/login');
        }

        $reparaciones = $this->reparaciones->where('activo', $activo)->findAll();
        $reparacionesin = $this->reparaciones->where('activo', $inactivo)->findAll();
        $autos = $this->autos->where('activo', 1)->findAll();
        $usuarios = $this->usuarios->where('activo', 1)->findAll();
        $repuestos = $this->repuestos->where('activo', 1)->findAll();
        $reparacionrepuestos = $this->reparacionrepuestos->where('activo', 1)->findAll();
---
SELECT *
FROM `reparacion_repuestos`
WHERE `activo` = 1